Revit 2024 API
StructuralSection.Dispose Method
Releases all resources used by the StructuralSection
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace